{
    "userdata": [
        {
            "userId": "201",
            "nickname": "Elenora Florwhisper",
            "userphoto": "assets/images/alluser/game/cc_1/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_1/userbg.jpg",
            "Introduction": "I am Elenora, the heroine of Peaceful Valley. Skilled in gardening and herbalism, I tend to the village's medicinal garden. Living in a fantasy rural world, I converse with plants daily and create potions to help villagers. My gentle yet resolute character makes me a spiritual pillar of the village. I believe the most powerful strength comes from caring for and respecting all life.",
            "post":[
                {
                    "postId": "201_1",
                    "title": "Valley Heroine: Elenora's Daily Life",
                    "content": "Sharing my Elenora Florwhisper cosplay from 'Peaceful Valley' game! This set showcases her daily routine: one photo shows her focused on watering medicinal plants with petals floating in sunlight; the other captures her hanging linen outside her cottage with a serene smile. The pink dress and intricate braids perfectly recreate this country girl's image, while every detail reflects her nature-loving quality from the game. Thanks to photographer @GameAlive for bringing the game scene into reality!",
                    "imag": "assets/images/alluser/game/cc_1/post.jpg"
                }
            ]
        },
        {
            "userId": "202",
            "nickname": "Morena Flamecrown",
            "userphoto": "assets/images/alluser/game/cc_2/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_2/userbg.jpg",
            "Introduction": "I am Morena, descendant of the ancient Flame family, possessing ancient fire elemental bloodline. Both scholar and sorceress, I move between the grand library and magic tower. I document ancient spells, study elemental mysteries, and compile magical tomes for future generations. Outwardly gentle yet inwardly resolute, my staff can awaken flame powers. My mission is to protect our lands from dark magic while seeking the lost elemental balance.",
            "post":[
                {
                    "postId": "202_1",
                    "title": "Flame Princess: The Dual Power of Knowledge and Magic",
                    "content": "Sharing my Morena Flamecrown cosplay from 'Age of Flame' game! This set showcases her dual identity: one photo presents her scholar image recording magical tomes in court, with a ruby crown displaying her noble status; the other shows her as a powerful sorceress holding a magical staff, ready to release fire spells. The deep red velvet robe and flame-like long hair perfectly recreate this fire elemental character from the game. Thanks to photographer @GameFlame for demonstrating the character's mysterious magical atmosphere through lighting effects!",
                    "imag": "assets/images/alluser/game/cc_2/post.jpg"
                }
            ]
        },
        {
            "userId": "203",
            "nickname": "Aria Starlight",
            "userphoto": "assets/images/alluser/game/cc_3/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_3/userbg.jpg",
            "Introduction": "I am Aria Starlight, outwardly a city café regular, but in truth a warrior of the secret Star Guardian organization. Possessing energy manipulation abilities and extraordinary combat skills. By day, I hide among ordinary people, enjoying moments of peace; when crisis strikes, I don armor to defend Earth from alien threats. My eyes see through illusions, my armor harbors the power of ancient stars. Balancing between two worlds remains my eternal challenge.",
            "post":[
                {
                    "postId": "203_1",
                    "title": "Dual Hero: From Café to Battlefield",
                    "content": "Showcasing my Aria Starlight cosplay from 'Star Guardians' game! This set presents her dual identity: one photo shows her everyday image enjoying quiet moments in a city café; the other reveals her Guardian form wearing starlight armor with extraordinary energy glowing in her eyes. The gray-blue tones run through both looks, symbolizing the cool composure she maintains regardless of identity. Thanks to photographer @StarGuardianStudio for perfectly capturing the character's transformation between ordinary and extraordinary!",
                    "imag": "assets/images/alluser/game/cc_3/post.jpg"
                }
            ]
        },
        {
            "userId": "204",
            "nickname": "Jaina Frostweave",
            "userphoto": "assets/images/alluser/game/cc_4/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_4/userbg.jpg",
            "Introduction": "I am Jaina Frostweave, Archmage of the Northern Continent, mastering frost magic and ancient spells. Once the youngest professor at the Royal Academy of Magic, now a respected elder among magic practitioners. My power stems from rigorous academic study and innate talent. Cold as ice on the surface, yet burning with passion to protect the innocent within. My mission is to balance magic and peace—even facing blizzards, I can find my path forward.",
            "post":[
                {
                    "postId": "204_1",
                    "title": "Frost Mage: The Dual Identity of Scholar and Warrior",
                    "content": "Presenting my Jaina Frostweave cosplay from 'Northern Legends' game! This set showcases her dual personality: one photo shows her as a scholar reading magical tomes indoors, immersed in knowledge; the other displays her warrior stance releasing powerful frost magic in snowy terrain. The blue and gold ornate armor and signature platinum braids perfectly recreate this powerful mage from the game. Thanks to photographer @FrostLight Studio for creating the striking contrast between warm interiors and cold snowscapes, demonstrating the character's charm and power!",
                    "imag": "assets/images/alluser/game/cc_4/post.jpg"
                }
            ]
        },
        {
            "userId": "205",
            "nickname": "Sophia Chromalight",
            "userphoto": "assets/images/alluser/game/cc_5/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_5/userbg.jpg",
            "Introduction": "I am Sophia Chromalight, an elegant flower market shop owner by day, and guardian of Neon City by night. In my surface life, I enjoy sunshine and sunflowers; when darkness falls, I don my quantum suit, using high-tech abilities to protect this city. My dual identity allows me to both appreciate the beauty of ordinary life and shoulder extraordinary responsibilities. Balancing these two worlds is a journey I continuously explore.",
            "post":[
                {
                    "postId": "205_1",
                    "title": "Neon Guardian: From Flower Market to Future Warrior",
                    "content": "Showcasing my Sophia Chromalight cosplay from 'Neon Guardian' game! This set presents her fascinating dual identity: one photo shows her everyday image selecting sunflowers in a sunny flower market, with teal and yellow tones displaying her warm character; the other reveals her guardian form wearing futuristic tech armor, ready for mission under city neon lights. From soft nature to future technology, perfectly interpreting this character's complexity from the game. Thanks to photographer @NeonVision for capturing the character's transformation between worlds through color and lighting!",
                    "imag": "assets/images/alluser/game/cc_5/post.jpg"
                }
            ]
        },
        {
            "userId": "206",
            "nickname": "Kira Datastream",
            "userphoto": "assets/images/alluser/game/cc_6/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_6/userbg.jpg",
            "Introduction": "I am Kira, a dual-faced character in the cyberpunk world. By day, I sell fruits at the old district market, interacting with ordinary people; by night, I transform into a hacker and information broker, navigating through data networks. My body is embedded with biochips and neon optoelectronic components, allowing seamless connection with any tech system. My rainbow-colored short hair and digital tattoos on my skin showcase my rebellious spirit. In this world where information is currency, I am both a participant in reality and a ruler of the data ocean.",
            "post":[
                {
                    "postId": "206_1",
                    "title": "Digital and Reality: Dual Life in a Cyberpunk World",
                    "content": "Showcasing my Kira Datastream cosplay from 'Cyber Edge' game! This set presents her dual identity in the cyberpunk world: one photo shows her everyday side selling fruits in a traditional market, with a smile hiding her secret identity; the other reveals her hacker form on neon-lit streets, equipped with glowing components and data interfaces. The rainbow short hair, biochips on skin, and LED glowing elements perfectly recreate this tech-savvy character from the game. Thanks to photographer @NeonBytes for creating the future world atmosphere from the game through strongly contrasting scenes!",
                    "imag": "assets/images/alluser/game/cc_6/post.jpg"
                }
            ]
        },
        {
            "userId": "207",
            "nickname": "Lara Croft",
            "userphoto": "assets/images/alluser/game/cc_7/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_7/userbg.jpg",
            "Introduction": "I am Lara Croft, archaeologist and adventurer. After graduating from an elite London university, I chose to explore the world's most dangerous ruins and tombs. Appearing as an ordinary girl on the surface, I possess exceptional skills to survive in extreme environments. I pursue historical truths and ancient secrets while fighting dark organizations attempting to exploit this knowledge. My journey is marked with scars and challenges, but each adventure makes me more resilient.",
            "post":[
                {
                    "postId": "207_1",
                    "title": "Dual Lara: Explorer from City to Wilderness",
                    "content": "Sharing my Lara Croft cosplay from 'Tomb Raider' game! This set showcases her dual life in the game: one photo shows her 'ordinary' moment in the city taking a brief rest with coffee, blood stains on her clothes hinting at recent dangers; the other displays her explorer image in an adventure environment, facing challenges with determination and confidence. From city to wilderness, from daily life to adventure, accurately recreating the multifaceted personality of this iconic character from the game. Thanks to photographer @TombRaiderLens for capturing the character's authenticity in different environments!",
                    "imag": "assets/images/alluser/game/cc_7/post.jpg"
                }
            ]
        },
        {
            "userId": "208",
            "nickname": "Ella Nightshade",
            "userphoto": "assets/images/alluser/game/cc_8/photo.jpg",
            "userbg": "assets/images/alluser/game/cc_8/userbg.jpg",
            "Introduction": "I am Ella Nightshade, outwardly an ordinary girl on city streets, but secretly a member of the Night Guardians organization. By day I blend in with everyone else, drinking coffee and walking through urban areas; by night I track criminal organizations in the city's shadows. Short hair, tattoos, and sharp eyes are my signature, reflecting my rebellious character. I know every alley, navigating the city maze effortlessly. My mission is to protect those who cannot protect themselves, even if no one knows I exist.",
            "post":[
                {
                    "postId": "208_1",
                    "title": "Night Guardian: The Dual-Faced Girl in the City",
                    "content": "Showcasing my Ella Nightshade cosplay from 'City Shadows' game! This set presents her dual life: one photo shows her relaxed street image leaning against a graffiti wall at dusk with a coffee cup; the other reveals her guardian identity alertly observing her surroundings on a post-rain street, holding a folding weapon ready for action. The sleek short hair and distinctive tattoos perfectly recreate this mysterious character's iconic appearance from the game. Thanks to photographer @UrbanShadow for enhancing the urban atmosphere through golden hour lighting effects, displaying the character's mysteriousness and vigilance!",
                    "imag": "assets/images/alluser/game/cc_8/post.jpg"
                }
            ]
        }
    ]
}